In [2]:
import pandas as pd

Reading in tables...

In [4]:
fp_departments= 'data/departments.csv'
fp_dept_emp= 'data/dept_emp.csv'
fp_dept_manager= 'data/dept_manager.csv'
fp_employees= 'data/employees.csv'
fp_salaries= 'data/salaries.csv'
fp_titles= 'data/titles.csv'

In [5]:
pd_departments= pd.read_csv(fp_departments)
pd_dept_emp= pd.read_csv(fp_dept_emp)
pd_dept_manager= pd.read_csv(fp_dept_manager)
pd_employees= pd.read_csv(fp_employees)
pd_salaries= pd.read_csv(fp_salaries)
pd_Tititles= pd.read_csv(fp_titles)

# Preview Tables

In [6]:
pd_departments.head(5)

  dept_no           dept_name
0    d001           Marketing
1    d002             Finance
2    d003     Human Resources
3    d004          Production
4    d005         Development
5    d006  Quality Management
6    d007               Sales
7    d008            Research
8    d009    Customer Service

In [7]:
pd_dept_emp.head(5)

   emp_no dept_no
0   10001    d005
1   10002    d007
2   10003    d004
3   10004    d004
4   10005    d003

In [8]:
pd_dept_manager.head(5)

  dept_no  emp_no
0    d001  110022
1    d001  110039
2    d002  110085
3    d002  110114
4    d003  110183

In [9]:
pd_employees.head(5)

   emp_no emp_title_id  birth_date  first_name  last_name sex   hire_date
0  473302        s0001   7/25/1953    Hideyuki   Zallocco   M   4/28/1990
1  475053        e0002  11/18/1954       Byong  Delgrande   F    9/7/1991
2   57444        e0002   1/30/1958       Berry       Babb   F   3/21/1992
3  421786        s0001   9/28/1957       Xiong   Verhoeff   M  11/26/1987
4  282238        e0003  10/28/1952  Abdelkader    Baumann   F   1/18/1991

In [10]:
pd_salaries.head(5)

   emp_no  salary
0   10001   60117
1   10002   65828
2   10003   40006
3   10004   40054
4   10005   78228

In [11]:
pd_titles.head(5)

  title_id               title
0    s0001               Staff
1    s0002        Senior Staff
2    e0001  Assistant Engineer
3    e0002            Engineer
4    e0003     Senior Engineer

# Verify Uniqueness of all PKs

In [13]:
# DEPARTMENTS
print(len(pd_departments['dept_no'].tolist()))
print(len(pd_departments['dept_no'].unique().tolist()))

9
9

In [27]:
# DEPT EMP
print(len(pd_dept_emp['emp_no'].tolist()))
print(len(pd_dept_emp['emp_no'].unique().tolist()))
print('------------')
print(len(pd_dept_emp['dept_no'].tolist()))
print(len(pd_dept_emp['dept_no'].unique().tolist()))
# FLAG FOR COMPOSITE, NO UNIQUE COLUMN

331603
300024
------------
331603
9

In [20]:
# DEPT MANAGER
print(len(pd_dept_manager['emp_no'].tolist()))
print(len(pd_dept_manager['emp_no'].unique().tolist()))

24
24

In [21]:
# SALARIES
print(len(pd_salaries['emp_no'].tolist()))
print(len(pd_salaries['emp_no'].unique().tolist()))

300024
300024

In [22]:
# EMPLOYEES
print(len(pd_employees['emp_no'].tolist()))
print(len(pd_employees['emp_no'].unique().tolist()))

300024
300024

In [24]:
# TITLES
print(len(pd_titles['title_id'].tolist()))
print(len(pd_titles['title_id'].unique().tolist()))

7
7